#Звёздочка (вложенные списки / матрица).
# Создайте матрицу 3×4 — список из трёх строк по четыре числа.
# Выведите: а) сумму всех элементов;
# б) сумму элементов в каждой строке;
# в) максимальный элемент во всей матрице;
# г) «транспонированную» матрицу
# (строки и столбцы поменять местами)
# — разберитесь самостоятельно,
# как это сделать через вложенные циклы и comprehension.
sum1 = 0

matrix = [
    [10, 20, 30, 40],
    [50, 60, 70, 80],
    [90, 100, 110, 120],
]

# for row in matrix:
#     for cell in row:
#
#         # print(cell)
#         sum1 += cell
#     print(sum1)
max1 = matrix[0][0]
for row in matrix:
    for cell in row:
        # print(cell)
        if cell > max1:
            max1 = cell

print(max1)
        


