#Словарь с defaultdict.
# Дан список кортежей [(имя, предмет, оценка), ...].
# Используя defaultdict(list),
# сгруппируйте оценки по именам студентов,
# а затем через defaultdict(list) или
# Counter выведите для каждого студента
# список его предметов и средний балл.
# (Подумайте: как посчитать средний балл, имея список оценок?)

grade_sheet = [
    ("Алексей", "история", 5),
    ("Татьяна", "русский язык", 3),
    ("Алексей", "математика", 4),
    ("Алена", "музыка", 4),
    ("Сергей", "ОБЖ", 5),
    ("Анна", "география", 3),

]
