
#из строки в список
text = "Занимательная   геометрия   и математика"
words = text.split() #['Занимательная', 'геометрия', 'и', 'математика']
print(words)

print(f"Слов в тексте: {len(words)} ") # 4
# Найти самое длинное слово

longest = ""
for word in words:
    if len(word) > len(longest):
        longest = word
print(f"Самое длинное слово:  {longest}")

# разделена по тире
#из списка в строку
new_text = "-".join(words)#Занимательная-геометрия-и-математика СПИСОК СЛОВ -СКЛЕЙт между собой
new1_text = " ".join(words) #Занимательная геометрия и математика убираем -

print(new_text, new1_text)
#из строки список из списка опять в строку для того чтобы убрать лишние пробелы
#см начало Почистить
normalized = " ".join(text.split()) #Занимательная геометрия и математика
print(normalized)
#символы только в строке проверяем
print(f" символов до очистки: {len(text)}")
print(f" символов   после очистки: {len(normalized)}")





