#слаг
#писать функции
#выполняется когда вызывается
# аргумент с типом данных строка
#принимает строку и возвращает строку

#слаг строка которую можно безопасно
# использовать в юрл адресе статья есть нам надо получить из заголовка безоп вариант который можно использовать
# В ерл адресе ддля браузера
#система автоматом готовит ссылку для этой статьи



def build_slug(title:str) ->str:
#прошлись по символам все символы стали не заглвными а строчными
    result = title.lower()
    result = result.replace(" ", "-")
    clean = []
    for char in result:
        if char.isalnum() or char == "-":
            clean.append(char)
        else:
            clean.append("-")
    result ="".join(clean)
#собираем в том виде в котором есть из списка строку
#избавляемся от лишних --
    while "--" in result:
        result = result.replace ("--", "-")
#по обем сторонам удаляем
    result = result.strip("-")
    return result
my_title = "Занимательная арифметика +++++ и пути ее применения!!!!!"
# занимательная-арифметика-и-пути-ее-применения
print(my_title)
print(build_slug(my_title))
# лучше резалт новую всегда создавать и явную.


